Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: The text of the window to get the state.
fr: Le texte de la fenêtre à traiter.

source: a value indicating the state of the window.
fr: Retourne une valeur indiquant l'état de la fenêtre.

source: Multiple values are added together so use BitAND() to examine the part you are interested in:
fr: Plusieurs valeurs peuvent être additionnées, donc utilisez BitAND() pour examiner la partie qui vous intéresse:

source: 1 = Window exists
fr: 1 = La fenêtre existe

source: 2 = Window is visible
fr: 2 = La fenêtre est visible

source: 4 = Window is enabled
fr: 4 = La fenêtre est installée

source: 8 = Window is active
fr: 8 = La fenêtre est active

source: 16 = Window is minimized
fr: 16 = La fenêtre est minimisée

source: 32 = Window is maximized
fr: 32 = La fenêtre est agrandie

source: 0 and sets the @error flag to non-zero if the window is not found.
fr: Retourne 0 et @error <> 0 si la fenêtre n'est pas trouvée.

source: Retrieve the state of the Notepad window using the handle returned by WinWait.
fr: Récupére l'état de la fenêtre du Bloc-notes en utilisant le handle renvoyé par WinWait.

source: Check if the Notepad window is minimized and display the appropriate message box.
fr: Teste si la fenêtre du Bloc-notes est minimisée et affiche la boîte de message appropriée.

source: The title/hWnd/class of the window to get the text.
fr: Le titre/hWnd/class de la fenêtre à traiter.

source: The text of the window to get the text.
fr: Le texte de la fenêtre à traiter.

source: a string containing the window text read.
fr: Retourne une chaine de caractères contenant le texte lu dans la fenêtre.

source: "" if the window is not found.
fr: Retourne "" si la fenêtre n'est pas trouvée.

source: Up to 64KB of window text can be retrieved.
fr: Jusqu'à 64 Ko de texte peut être récupéré.

source: WinGetText() works on minimized windows, but only works on hidden windows if you've set AutoItSetOption("WinDetectHiddenText", 1)
fr: WinGetText() fonctionne sur les fenêtres réduites, mais ne fonctionne sur les fenêtres cachées que si vous avez défini AutoItSetOption("WinDetectHiddenText", 1).

source: If multiple windows match the criteria for WinGetText(), the information for the most recently active match is returned.
fr: Si plusieurs fenêtres correspondent aux critères pour WinGetText(), les informations de la fenêtre la plus récente seront retournés.

source: Use WinGetText("[active]") to get the active window's text.
fr: Utilisez WinGetText("[active]") pour obtenir un texte de la fenêtre active.

source: Retrieve the window text of the active window.
fr: Récupére le texte de la fenêtre de la fenêtre active.

source: Display the window text.
fr: Affiche le texte de la fenêtre.

source: The title/hWnd/class of the window to get the title.
fr: Le titre/hWnd/class de la fenêtre à traiter.

source: The text of the window to get the title.
fr: Le texte de la fenêtre à traiter.

source: a string containing the complete window title.
fr: Retourne une chaîne de caractères contenant le titre complet de la fenêtre.

source: WinGetTitle("[active]") returns the active window's title.
fr: WinGetTitle("[active]") retourne le titre de la fenêtre active.

source: WinGetTitle() works on both minimized and hidden windows.
fr: WinGetTitle() fonctionne aussi bien sur les fenêtres minimisées et cachées.

source: Retrieve the window title of the active window.
fr: Récupére le titre de la fenêtre de la fenêtre active.

source: Display the window title.
fr: Affiche le titre de la fenêtre.

source: The function only returns the success value.
fr: La fonction retourne une valeur seulement en cas de succès.

source: The difference between this function and WinClose() is that WinKill() will forcibly terminate the window if it doesn't close quickly enough.
fr: La différence entre cette fonction et WinClose() est que WinKill() fermera la fenêtre de force si elle ne se referme pas assez vite.

source: Consequently, a user might not have time to respond to dialogs prompting the user to save data.
fr: Par conséquent, un utilisateur pourrait ne pas avoir le temps de répondre aux boîtes de dialogue lui demandant d'enregistrer les données.

source: Although WinKill() can work on both minimized and hidden windows, some windows (notably explorer windows) can only be terminated using WinClose().
fr: Bien que WinKill() peut travailler sur les fenêtres réduites et cachées, certaines fenêtres (Windows Explorer notamment) ne peuvent être fermées qu'avec WinClose().

source: Wait for 2 seconds before calling the WinKill function.
fr: Attend deux secondes avant d'appeler la fonction WinKill.

source: Kill the window using the handle returned by WinWait.
fr: Tue la fenêtre en utilisant Le handle retournée par WinWait.

source: The title/hWnd/class of the windows to get the list.
fr: Le titre/hWnd/class des fenêtres à lister.

source: The text of the windows to get the list.
fr: Le texte des fenêtres à lister.

source: Returns an array of matching window titles and handles.
fr: Retourne un tableau correspondant aux titres et handles des fenêtres trouvées.

source: If no title and text is given then all top-level windows are returned.
fr: Si aucun titre ou texte n'est donné, alors toutes les fenêtres de niveau supérieur sont retournées.

source: $aArray[0][0] = Number of windows returned
fr: $array[0][0] = Nombre de fenêtres retournées

source: $aArray[1][0] = 1st window title
fr: $array[1][0] = Titre de la première fenêtre

source: $aArray[1][1] = 1st window handle (HWND)
fr: $array[1][1] = Handle de la première fenêtre (HWND)

source: $aArray[2][0] = 2nd window title
fr: $array[2][0] = Titre de la deuxième fenêtre

source: $aArray[2][1] = 2nd window handle (HWND)
fr: $array[2][1] = Handle de la deuxième fenêtre (HWND)

source: $aArray[n][0] = nth window title
fr: $array[n][0] = Titre de la n-ième fenêtre

source: $aArray[n][1] = nth window handle (HWND)
fr: $array[n][1] = Handle de la n-ième fenêtre (HWND)

source: Retrieve a list of window handles.
fr: Récupère une liste de handles de fenêtre.

source: Loop through the array displaying only visable windows with a title.
fr: Boucle dans le tableau pour afficher uniquement les fenêtres visibles avec un titre.

source: Retrieve a list of window handles using a regular expression.
fr: Récupère une liste de handles de fenêtre à l'aide d'une expression régulière.

source: The regular expression looks for titles that contain the word SciTE or Internet Explorer.
fr: L'expression régulière recherche des titres qui contiennent le mot SciTE ou Internet Explorer.

source: The title/hWnd/class of the window to select the item.
fr: Le titre/hWnd/class de la fenêtre où sélectionner l'item.

source: The text of the window to select the item.
fr: Le texte de la fenêtre où sélectionner l'item.

source: Text of Menu Item
fr: Texte de l'élément du menu.

source: Text of SubMenu item
fr: Texte de l'élément du sous menu

source: 0 if the menu is not found.
fr: Retourne 0 si le menu n'est pas trouvé.

source: You should note that underlined menu items actually contain a & character to indicate the underlining.
fr: Notez que les éléments de menu souligné contiennent un caractère & afin d'indiquer le soulignement.

source: Thus, the menu item File would actually require the text "&File", and Convert would require "Con&vert" You can access menu items up to six levels deep; and the window can be inactive, minimized, and/or even hidden.
fr: Ainsi, l'élément du menu Fichier devra contenir l'élément "&Fichier", et Convert devra contenir l’élément "Con&vert".Vous pouvez accéder aux éléments du menu jusqu'à six niveaux de profondeur; et la fenêtre peut être inactive, minimisée et/ou cachée.

source: WinMenuSelectItem() will only work on standard menus.
fr: WinMenuSelectItem() ne fonctionne que sur des menus standard.

source: Unfortunately, many menus in use today are actually custom written or toolbars "pretending" to be menus.
fr: Malheureusement, aujourd'hui, de nombreux menus ou barres d'outils sont personnalisés afin de "prétendre" d'être des menus.

source: This is true for most Microsoft applications.
fr: Ceci est vrai pour la plupart des applications Microsoft.

source: This will select File and then Page Setup in notepad
fr: Cela permet de sélectionner 'File', puis 'Page Setup' dans le bloc-notes

source: Send("#m") is a possible alternative.
fr: Send("#m") est une alternative possible.

source: Send("#+m") is a possible alternative.
fr: Send("#+m") est une alternative possible.

source: The title/hWnd/class of the window to move/resize.
fr: Le titre/hWnd/class de la fenêtre à déplacer/redimensionner.

source: The text of the window to move/resize.
fr: Le texte de la fenêtre à déplacer/redimensionner.

source: X coordinate to move to.
fr: Coordonnée X pour le déplacement.

source: Y coordinate to move to.
fr: Coordonnée Y pour le déplacement.

source: the speed to move the windows in the range 1 (fastest) to 100 (slowest).
fr: La vitesse de déplacement de la fenêtre comprise entre 1 (rapide) et 100 (lent).

source: If not defined the move is instantaneous.
fr: Si non défini, le déplacement est instantané.

source: WinMove() has no effect on minimized windows, but WinMove() works on hidden windows.
fr: WinMove() n'a pas d'effet sur les fenêtres minimisées, mais fonctionne sur les fenêtres cachées.

source: If the width and height are small (or negative), the window will go no smaller than 112 x 27 pixels.
fr: Si la largeur et la hauteur sont trop petites (ou négative), la fenêtre n'ira pas en dessous de 112 x 27 pixels.

source: If width and height are large, the window will go no larger than approximately [12+@DesktopWidth] x [12+@DesktopHeight] pixels.
fr: Si la largeur et la hauteur sont trop grandes, La fenêtre ne sera pas plus grande que [12 + @DesktopWidth] x [12 + @DesktopHeight] pixels.

source: Negative values are allowed for the x and y coordinates.
fr: Des valeurs négatives sont autorisées pour les coordonnées de x et de y.

source: In fact, you can move a window off screen; and if the window's program is one that remembers its last window position, the window will appear in the corner (but fully on-screen) the next time you launch the program.
fr: En fait, vous pouvez déplacer la fenêtre hors de la zone de l'écran; et si la fenêtre du programme est une fenêtre qui se rappelle de sa dernière position sur l'écran, la fenêtre apparaîtra dans le coin (mais entièrement à l'écran) la prochaine fois que vous lancerez le programme.

source: When speed is used the move is done with the new size.
fr: Lorsque le paramètre vitesse est utilisé, le déplacement est effectué avec la nouvelle dimension.

source: Retrieve the position as well as the height and width of the Notepad window.
fr: Récupère la position ainsi que la hauteur et la largeur de la fenêtre du Bloc-notes.

source: We will use this when we have to move the window back to the original position.
fr: Nous les utiliserons lorsque nous déplacerons la fenêtre à sa position initiale.

source: Move the Notepad to the x, y position of 0, 0 and set the height and width at 200, 200.
fr: Déplace le bloc-notes à la position x, y de 0, 0 et définit la hauteur et la largeur à 200, 200.

source: Wait for 2 seconds to display the new position of the Notepad window.
fr: Attend 2 secondes pour afficher la nouvelle position de la fenêtre du Bloc-notes.

source: Move the Notepad window back to the original position by using the array returned by WinGetPos.
fr: Déplace la fenêtre du Bloc-notes de retour à sa position initiale en utilisant le tableau renvoyé par WinGetPos.

source: Wait for 2 seconds to display the original position of the Notepad window.
fr: Attend 2 secondes pour afficher la position initiale de la fenêtre du Bloc-notes.

source: WinNet user defined functions Reference
fr: WinNet - Référence

source: When using them you need to add a #include <WinNet.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <WinNet.au3>.

source: Determines whether the window should have the "TOPMOST" flag set.
fr: Détermine si la fenêtre doit avoir le paramètre "Mise en avant plan (TOPMOST)" activé.

source: 0 = remove on top flag
fr: 0 = Désactive l'avant plan

source: 1 = set on top flag
fr: 1 = Active l'avant plan

source: Third-party programs which add an "Always On Top" context menu entry might not update their menu entry to reflect the AutoIt-induced change in TOPMOST status.
fr: Les programmes tiers incluant un menu contextuel "Toujours à l'avant plan (Always on Top)" ne pourront mettre à jour l'entrée de leur menu pour refléter le changement de statut de AutoIt en TOPMOST.

source: Retrieve the handle of the active window.
fr: Récupère le handle de la fenêtre active.

source: Set the active window as being ontop using the handle returned by WinGetHandle.
fr: Définit la fenêtre active comme étant 'on top' à l'aide du handle renvoyé par WinGetHandle.

source: Wait for 2 seconds to display the change.
fr: Attend 2 secondes pour afficher le changement.

source: Remove the "topmost" state from the active window.
fr: Retire l'état "topmost" à la fenêtre active.

source: The title/hWnd/class of the window to change the state.
fr: Le titre/hWnd/class de la fenêtre dont l'état doit changer.

source: The text of the window to change the state.
fr: Le texte de la fenêtre dont l'état doit changer.

source: @SW_SHOW = Shows a previously hidden window
fr: @SW_SHOW = Afficher une fenêtre précédemment cachée

source: @SW_RESTORE = Undoes a window minimization or maximization
fr: @SW_RESTORE = Annule une minimisation ou l'agrandissement d'une fenêtre

source: @SW_MINIMIZE and @SW_MAXIMIZE even work on modal dialog windows.
fr: @SW_MINIMIZE et @SW_MAXIMIZE fonctionnent aussi sur les boîtes de dialogue modales Windows.

source: Set the state of the Notepad window to "hide".
fr: Définit l'état de la fenêtre du Bloc-notes à "cachée".

source: Set the state of the Notepad window to "show".
fr: Définit l'état de la fenêtre du Bloc-notes de "affichée".

source: If multiple windows match the criteria the title of most recently active window is changed.
fr: Si plusieurs fenêtres correspondent aux critères, le titre de la fenêtre la plus récente est changé.

source: Set the title of the Notepad window using the handle returned by WinWait.
fr: Définit le titre de la fenêtre du Bloc-notes en utilisant le handle renvoyé par WinWait.

source: Wait for 2 seconds to display the Notepad window and the new title.
fr: Attend 2 secondes pour afficher la fenêtre du Bloc-notes et le nouveau titre.

source: A number in the range 0 - 255.
fr: Un nombre entre 0 et 255.

source: The lower the number, the more transparent the window will become.
fr: Plus le nombre est petit, plus la fenêtre sera transparente.

source: 255 = Solid, 0 = Invisible.
fr: 255 = Normal, 0 = Invisible.

source: 0 and sets the @error flag to non-zero if no supported on the OS.
fr: Retourne 0 et @error <> 0 si la fonction n'est pas supportée par l'OS.

source: Screen color must be greater or equal to 16-bit.
fr: La couleur de l'écran doit être égale ou supérieure à 16-bit.

source: Set the transparency of the Notepad window to 170.
fr: Définit la transparence de la fenêtre du Bloc-notes à 170.

source: Timeout in seconds if the window does not exist.
fr: Temporisation en secondes si la fenêtre n'existe pas.

source: Default is 0 (no timeout).
fr: La valeur par défaut est 0 (pas de temporisation).

source: a handle to the requested window.
fr: Retourne un handle sur la fenêtre demandée.

source: 0 if timeout occurred.
fr: Retourne 0 si la temporisation est écoulée.

source: The window is polled every 250 milliseconds or so.
fr: La fenêtre est interrogée toutes les 250 millisecondes ou plus.

source: Timeout in seconds if the window is not active.
fr: Temporisation en secondes si la fenêtre n'est pas active.

source: Timeout in seconds if the window is not closed.
fr: Temporisation en secondes si la fenêtre n'est pas fermée.

source: If the window already doesn't exist when this function is called it will return 1 immediately.
fr: Si la fenêtre n'existe déjà plus lorsque cette fonction est appelée, elle retournera 1 immédiatement.

source: Wait for the window "[CLASS:Notepad]" to not exist.
fr: Attend que la fenêtre "[CLASS:Notepad]" n'existe plus.

source: Wait a maximum of 5 seconds for "[CLASS:Notepad]" to not exist.
fr: Attend un maximum de 5 secondes pour que "[CLASS:Notepad]" n'existe plus.

source: Timeout in seconds if the window is still active.
fr: Temporisation en secondes si la fenêtre est encore active.

source: Wait for the window "[CLASS:Notepad]" to not be active.
fr: Attend que la fenêtre "[CLASS:Notepad]" ne soit plus active.

source: Wait a maximum of 5 seconds for "[CLASS:Notepad]" to not be active.
fr: Attend un maximum de 5 secondes que "[CLASS:Notepad]" ne soit plus active.

source: Word user defined functions Reference
fr: Word - Référence

source: When using them you need to add a #include <Word.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <Word.au3>.
